cask_args appdir: "/Applications"

brew "mas"
brew 'mackup'
brew "curl"
brew 'tree'
brew "git"
brew "npm"
brew "asdf"
brew "bat"
brew "exa"
brew "fzf"
brew "grep"
brew "ripgrep"
brew "jq"
brew "starship"
brew "stow"
brew "tealdeer"
brew "tmux"
brew 'ghq'
brew 'hub'
brew 'openssl'
brew 'shellcheck'
brew "skhd"
tap "koekeishiya/formulae"
brew "yabai"
tap 'heroku/brew'
brew 'heroku'
# brew 'rbenv'
# brew "lf"
# brew "htop"
# brew "ncdu"
# brew "zoxide"
# tap "github/gh"
# brew "gh"
# tap "cjbassi/ytop"
# brew "ytop"
# tap 'jesseduffield/lazydocker'
# brew 'lazydocker'

cask "alacritty"
cask 'iterm2'
cask "alfred"
cask "google-chrome"
cask "google-japanese-ime"
cask 'firefox'
cask "insomnia"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask 'appcleaner'
cask 'docker'
cask 'clipy'
cask 'kindle'
cask 'gyazo'
cask 'ngrok'
tap "jason0x43/homebrew-neovim-nightly"
cask "neovim-nightly"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
# cask 'sequel-pro'
# cask 'mysqlworkbench' バージョンが新しすぎるためてブラウザからダウンロード(6.3.10)
# cask 'sourcetree'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'virtualbox'
# cask 'spectacle'

#  mas 'LINE', id: 539883307
#  mas 'Microsoft OneNote', id: 784801555
#  mas 'Duplicate Photos Fixer Pro', id: 963642514
