tap "cjbassi/ytop"
tap "extrawurst/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jason0x43/homebrew-neovim-nightly"
tap "koekeishiya/formulae"
tap 'heroku/brew'
# tap "github/gh"
# tap "wix/brew"
cask_args appdir: "/Applications"

brew "asdf"
brew "bat"
brew "curl"
brew "exa"
#brew "fzf"
#brew "gh"
brew "git"
brew "grep"
#brew "htop"
brew "jq"
brew "mas"
#brew "ncdu"
brew "skhd"
brew "starship"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "yabai"
#brew "ytop"
#brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "svn"
brew 'mackup'
# brew 'ghq'
# brew 'peco'
# brew 'zplug'
brew 'coreutils'
brew 'tree'
brew 'heroku'
brew 'openssl'
brew 'rbenv'

cask "alacritty"
cask "alfred"
cask "font-roboto"
cask "font-roboto-mono"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
cask "insomnia"
cask "neovim-nightly"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask 'appcleaner'
cask 'docker'
cask 'iterm2'
cask 'firefox'
cask 'clipy'
cask 'kindle'
cask 'gyazo'
cask 'ngrok'
# cask 'mysqlworkbench' バージョンが新しすぎるためてブラウザからダウンロード(6.3.10)
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'virtualbox'
# cask 'sequel-pro'

#  mas 'LINE', id: 539883307
#  mas 'Microsoft OneNote', id: 784801555
#  mas 'Duplicate Photos Fixer Pro', id: 963642514
